status/src/2022/0603.org
#+TITLE: 28 May 2022 - 03 June 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** PS8
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Started Problem Set 2
*** Planning experiment to measure 'g'
** 21G.701 Spanish
*** Finished Episodes 30-31 (no progress this week)
* Sekar Kembar Gong Hooks (done)
* Hospice Quilt Top Layout
  Started program to verify layout constraints
* BWMSE
  Added more stuff.
* Golang
  Investigating...
* Mom's Antique Chair
  Glued up and reassembled.
* Emergency Crystal Radio
** Front panel drilled out.
** Inductor selector switch wrong. Need to find a correct switch.
* POM 3D print
  Using "Type T" rpi0w pallet to test POM filament. Need to fix hole
  depth on side holes.
* Mill Controller #2
** Potential for using old Compaq iPaq boards.
** May use OLPC in the meantime.
** Still having problems with mill controller booting reliably.
** Cleaned out controller
** Have RTC batteries - need to replace
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Virtual Orchestra
** sfz file tests
   SFZ Generation started.
* Azure
  Investigated using Azure to host images for github testing. Seems to
  be difficult to determine (and cap!) costs.
* GAC
  Fixed some math errors. More to go.
* Intel i5
  Still looking for a suitable motherboard and system. Reminds me why
  this is one of my least favorite activities.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 9/6/2022
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)
** Sentencing 9/20/2022
