status/2022/0603.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-04 Sat 06:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>28 May 2022 - 03 June 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">28 May 2022 - 03 June 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ca9b2a">1. MIT OCW</a>
<ul>
<li><a href="#org41d065d">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org3a88fd2">1.1.1. PS8</a></li>
</ul>
</li>
<li><a href="#org0d22d25">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org9073f62">1.2.1. Started Problem Set 2</a></li>
<li><a href="#org26c3836">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#orgfaf933a">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org3221460">1.3.1. Finished Episodes 30-31 (no progress this week)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf719165">2. Sekar Kembar Gong Hooks (done)</a></li>
<li><a href="#org4214b9a">3. Hospice Quilt Top Layout</a></li>
<li><a href="#org7d3d3fd">4. BWMSE</a></li>
<li><a href="#org26e4671">5. Golang</a></li>
<li><a href="#org5269dcf">6. Mom's Antique Chair</a></li>
<li><a href="#org6ad2138">7. Emergency Crystal Radio</a>
<ul>
<li><a href="#orgc741323">7.1. Front panel drilled out.</a></li>
<li><a href="#org5767e5f">7.2. Inductor selector switch wrong. Need to find a correct switch.</a></li>
</ul>
</li>
<li><a href="#org882bc92">8. POM 3D print</a></li>
<li><a href="#orgdbbae5d">9. Mill Controller #2</a>
<ul>
<li><a href="#org83777e9">9.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#orgf745506">9.2. May use OLPC in the meantime.</a></li>
<li><a href="#org6309eee">9.3. Still having problems with mill controller booting reliably.</a></li>
<li><a href="#org26932b4">9.4. Cleaned out controller</a></li>
<li><a href="#org2f348cf">9.5. Have RTC batteries - need to replace</a></li>
</ul>
</li>
<li><a href="#orge7fb021">10. OLPC</a>
<ul>
<li><a href="#orgae93961">10.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org673ca99">11. Virtual Orchestra</a>
<ul>
<li><a href="#org707a483">11.1. sfz file tests</a></li>
</ul>
</li>
<li><a href="#orgcd171f5">12. Azure</a></li>
<li><a href="#orgf7eb259">13. GAC</a></li>
<li><a href="#org912e576">14. Intel i5</a></li>
<li><a href="#orge156318">15. David Davies</a>
<ul>
<li><a href="#org047f14e">15.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org3a7c634">15.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org8b33487">15.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org4c84c6e">16. Peter Kim</a>
<ul>
<li><a href="#orgae9396e">16.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org0895af0">16.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org8219a59">16.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#org9b58df8">16.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1ca9b2a" class="outline-2">
<h2 id="org1ca9b2a"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org41d065d" class="outline-3">
<h3 id="org41d065d"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3a88fd2" class="outline-4">
<h4 id="org3a88fd2"><span class="section-number-4">1.1.1</span> PS8</h4>
</div>
</div>
<div id="outline-container-org0d22d25" class="outline-3">
<h3 id="org0d22d25"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9073f62" class="outline-4">
<h4 id="org9073f62"><span class="section-number-4">1.2.1</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-org26c3836" class="outline-4">
<h4 id="org26c3836"><span class="section-number-4">1.2.2</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-orgfaf933a" class="outline-3">
<h3 id="orgfaf933a"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org3221460" class="outline-4">
<h4 id="org3221460"><span class="section-number-4">1.3.1</span> Finished Episodes 30-31 (no progress this week)</h4>
</div>
</div>
</div>
<div id="outline-container-orgf719165" class="outline-2">
<h2 id="orgf719165"><span class="section-number-2">2</span> Sekar Kembar Gong Hooks (done)</h2>
</div>
<div id="outline-container-org4214b9a" class="outline-2">
<h2 id="org4214b9a"><span class="section-number-2">3</span> Hospice Quilt Top Layout</h2>
<div class="outline-text-2" id="text-3">
<p>
Started program to verify layout constraints
</p>
</div>
</div>
<div id="outline-container-org7d3d3fd" class="outline-2">
<h2 id="org7d3d3fd"><span class="section-number-2">4</span> BWMSE</h2>
<div class="outline-text-2" id="text-4">
<p>
Added more stuff.
</p>
</div>
</div>
<div id="outline-container-org26e4671" class="outline-2">
<h2 id="org26e4671"><span class="section-number-2">5</span> Golang</h2>
<div class="outline-text-2" id="text-5">
<p>
Investigating&#x2026;
</p>
</div>
</div>
<div id="outline-container-org5269dcf" class="outline-2">
<h2 id="org5269dcf"><span class="section-number-2">6</span> Mom's Antique Chair</h2>
<div class="outline-text-2" id="text-6">
<p>
Glued up and reassembled.
</p>
</div>
</div>
<div id="outline-container-org6ad2138" class="outline-2">
<h2 id="org6ad2138"><span class="section-number-2">7</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgc741323" class="outline-3">
<h3 id="orgc741323"><span class="section-number-3">7.1</span> Front panel drilled out.</h3>
</div>
<div id="outline-container-org5767e5f" class="outline-3">
<h3 id="org5767e5f"><span class="section-number-3">7.2</span> Inductor selector switch wrong. Need to find a correct switch.</h3>
</div>
</div>
<div id="outline-container-org882bc92" class="outline-2">
<h2 id="org882bc92"><span class="section-number-2">8</span> POM 3D print</h2>
<div class="outline-text-2" id="text-8">
<p>
Using "Type T" rpi0w pallet to test POM filament. Need to fix hole
depth on side holes.
</p>
</div>
</div>
<div id="outline-container-orgdbbae5d" class="outline-2">
<h2 id="orgdbbae5d"><span class="section-number-2">9</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org83777e9" class="outline-3">
<h3 id="org83777e9"><span class="section-number-3">9.1</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-orgf745506" class="outline-3">
<h3 id="orgf745506"><span class="section-number-3">9.2</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org6309eee" class="outline-3">
<h3 id="org6309eee"><span class="section-number-3">9.3</span> Still having problems with mill controller booting reliably.</h3>
</div>
<div id="outline-container-org26932b4" class="outline-3">
<h3 id="org26932b4"><span class="section-number-3">9.4</span> Cleaned out controller</h3>
</div>
<div id="outline-container-org2f348cf" class="outline-3">
<h3 id="org2f348cf"><span class="section-number-3">9.5</span> Have RTC batteries - need to replace</h3>
</div>
</div>
<div id="outline-container-orge7fb021" class="outline-2">
<h2 id="orge7fb021"><span class="section-number-2">10</span> OLPC</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgae93961" class="outline-3">
<h3 id="orgae93961"><span class="section-number-3">10.1</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org673ca99" class="outline-2">
<h2 id="org673ca99"><span class="section-number-2">11</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org707a483" class="outline-3">
<h3 id="org707a483"><span class="section-number-3">11.1</span> sfz file tests</h3>
<div class="outline-text-3" id="text-11-1">
<p>
SFZ Generation started.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd171f5" class="outline-2">
<h2 id="orgcd171f5"><span class="section-number-2">12</span> Azure</h2>
<div class="outline-text-2" id="text-12">
<p>
Investigated using Azure to host images for github testing. Seems to
be difficult to determine (and cap!) costs.
</p>
</div>
</div>
<div id="outline-container-orgf7eb259" class="outline-2">
<h2 id="orgf7eb259"><span class="section-number-2">13</span> GAC</h2>
<div class="outline-text-2" id="text-13">
<p>
Fixed some math errors. More to go.
</p>
</div>
</div>
<div id="outline-container-org912e576" class="outline-2">
<h2 id="org912e576"><span class="section-number-2">14</span> Intel i5</h2>
<div class="outline-text-2" id="text-14">
<p>
Still looking for a suitable motherboard and system. Reminds me why
this is one of my least favorite activities.
</p>
</div>
</div>
<div id="outline-container-orge156318" class="outline-2">
<h2 id="orge156318"><span class="section-number-2">15</span> David Davies</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org047f14e" class="outline-3">
<h3 id="org047f14e"><span class="section-number-3">15.1</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org3a7c634" class="outline-3">
<h3 id="org3a7c634"><span class="section-number-3">15.2</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org8b33487" class="outline-3">
<h3 id="org8b33487"><span class="section-number-3">15.3</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org4c84c6e" class="outline-2">
<h2 id="org4c84c6e"><span class="section-number-2">16</span> Peter Kim</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgae9396e" class="outline-3">
<h3 id="orgae9396e"><span class="section-number-3">16.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org0895af0" class="outline-3">
<h3 id="org0895af0"><span class="section-number-3">16.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org8219a59" class="outline-3">
<h3 id="org8219a59"><span class="section-number-3">16.3</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-org9b58df8" class="outline-3">
<h3 id="org9b58df8"><span class="section-number-3">16.4</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-06-04 Sat 06:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
